In [131]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [132]:
# read data 
df = pd.read_csv(
    'assignment-datasets/Stock_File_1.csv',
    # index_col=0,
    )

df.head()

        Date    Open    High    Low   Close Volume
0   1-Jun-06  471.60  474.00  442.0  444.42  21900
1  12-Jun-06  454.00  464.00  440.0  446.17   8400
2  22-Jun-06  451.16  464.20  447.6  460.26  19400
3   3-Jul-06  495.10  509.68  493.0  498.97   9100
4  13-Jul-06  518.00  526.40  517.0  521.66   6800

In [122]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    165 non-null    object
 1   Open    161 non-null    float64
 2   High    158 non-null    float64
 3   Low     159 non-null    float64
 4   Close   158 non-null    float64
 5   Volume  165 non-null    object
dtypes: float64(4), object(2)
memory usage: 7.9+ KB

In [123]:
# import the second data set into the notebook.
df2 = pd.read_csv(
    'assignment-datasets/Stock_File_2.txt',
    # index_col=0,
    )
df2.head()

        Date   Open    High     Low   Close Volume
0   3-Jan-11  798.0  824.95  796.00  810.55  17600
1  13-Jan-11  748.1  768.00     NaN  752.85  13000
2  24-Jan-11  741.0  626.01  732.55     NaN   8700
3   1-Feb-11  753.0  753.00  712.10  717.25  23700
4  11-Feb-11  647.9  654.55  626.35  642.40  12800

In [124]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 204 entries, 0 to 203
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    204 non-null    object
 1   Open    201 non-null    float64
 2   High    195 non-null    float64
 3   Low     197 non-null    float64
 4   Close   197 non-null    float64
 5   Volume  204 non-null    object
dtypes: float64(4), object(2)
memory usage: 9.7+ KB

In [125]:
print(f""""
{
    df.shape,
    df2.shape
}
""")

"
((165, 6), (204, 6))

In [126]:
df.describe()

              Open         High          Low        Close
count   161.000000   158.000000   159.000000   158.000000
mean    846.829317   808.525253   810.990000   819.263481
std     295.961500   269.669343   270.408865   272.956317
min     364.000000   366.000000   354.000000   363.600000
25%     700.040000   642.500000   676.100000   686.075000
50%     794.000000   782.250000   772.000000   781.815000
75%     922.000000   898.750000   893.000000   891.025000
max    1755.800000  1650.000000  1600.050000  1607.850000

In [127]:
df2.describe()

              Open         High          Low        Close
count   201.000000   195.000000   197.000000   197.000000
mean    925.104975   899.703641   892.973858   905.464213
std     295.739605   274.639593   263.678769   264.815889
min     455.000000   366.200000   450.900000   453.900000
25%     702.100000   687.150000   682.900000   690.350000
50%     840.000000   825.950000   820.500000   835.950000
75%    1165.550000  1137.000000  1142.000000  1148.650000
max    2291.950000  1445.000000  1405.100000  1414.850000

In [128]:
# find the null values.
print(df.isnull().sum())
print("*"*50)
print(df2.isnull().sum())

Date      0
Open      4
High      7
Low       6
Close     7
Volume    0
dtype: int64
**************************************************
Date      0
Open      3
High      9
Low       7
Close     7
Volume    0
dtype: int64

In [130]:
# check if dataframe1 and dataframe2 have the same columns.
print(df.columns.equals(df2.columns))
print(df.Date.equals(df2.Date))
print(df.Volume.equals(df2.Volume))
print(df.High.equals(df2.High))
print(df.Low.equals(df2.Low))
print(df.Close.equals(df2.Close))
print(df.Volume.equals(df2.Volume))

True
False
False
False
False
False
False

In [134]:
df.duplicated().sum()
df2.duplicated().sum()

0

In [142]:
df.value_counts()
df2.value_counts()

Date       Open     High     Low      Close    Volume
1-Apr-11   797.25   800.00   775.00   783.15   13500     1
21-Nov-12  710.00   714.00   705.00   708.75   3900      1
21-Aug-14  1019.50  1033.05  1005.00  1011.20  12500     1
21-Dec-15  1148.00  1155.80  1129.60  1141.55  7700      1
21-Feb-11  668.35   668.90   657.05   662.60   16100     1
                                                        ..
11-Jun-12  766.00   781.00   748.00   755.25   7800      1
11-Jun-15  1296.65  1315.15  1261.00  1267.55  3900      1
11-Mar-11  736.50   749.00   720.00   734.70   37100     1
11-Mar-16  1155.05  1175.15  1142.00  1147.30  6100      1
3-Sep-12   724.00   727.00   712.00   720.30   3900      1
Length: 178, dtype: int64

In [137]:
frequency_table = df.apply(
    lambda x: pd.value_counts(x.values, sort=False),
)